{
  "backend/main.mo": "Main Motoko actor for the AstCloud pet memorial app, defining types for user profiles, animals, and orders, with role-based access control, order management, user profile CRUD, and Stripe payment integration via HTTP outcalls.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (heart/hexagon/square resin memorial image generation and ShapeShowcases rendering updates) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Auto-generated JSON document summarizing each frontend source file's purpose, covering components, hooks, styles, and pages for the Furever Keepsakes and Memorials app.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining OKLCH-based design tokens for light and dark themes, including colors for background, foreground, primary, sidebar, and chart variables.",
  "frontend/index.html": "HTML entry point for the React app, setting the page title to 'Furever Keepsakes and Memorials - Pet Memorials' and mounting the app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for the main page, payment success/failure, and renders a profile setup modal for newly authenticated users alongside the main page layout.",
  "frontend/src/components/marketing/Footer.tsx": "Marketing footer component displaying the 'Furever Keepsakes and Memorials' brand, smooth-scroll quick links, contact blurb, copyright notice, and a caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/marketing/Header.tsx": "Sticky site header with logo, smooth-scroll nav links, and a login/logout button using Internet Identity authentication. Supports both desktop and mobile (hamburger) layouts.",
  "frontend/src/components/marketing/Sections/AboutResin.tsx": "Marketing section explaining the three key features of the resin memorials: crystal-clear resin, natural botanical elements, and printed photographs.",
  "frontend/src/components/marketing/Sections/Hero.tsx": "Landing hero section with headline, tagline, description, CTA buttons to scroll to designs or process, and a featured product image.",
  "frontend/src/components/marketing/Sections/PetPhotoUpload.tsx": "Empty file with no content.",
  "frontend/src/components/marketing/Sections/ProcessSteps.tsx": "Four-step process section describing how each resin memorial is made, from photo selection through professional printing, placement, and resin curing.",
  "frontend/src/components/marketing/Sections/ShapeShowcases.tsx": "Design showcase section displaying three available memorial shapes (square, heart, hexagon) with example images, pet names, and descriptions.",
  "frontend/src/components/order/OrderForm.tsx": "Order form section that collects pet name, birth/death dates, a photo upload (with preview and progress), and payment method, then submits the order via a mutation hook requiring Internet Identity authentication.",
  "frontend/src/components/payment/PaymentFailure.tsx": "Payment failure page that informs the user no charge was made and provides buttons to retry or return to the home page.",
  "frontend/src/components/payment/PaymentMethodSelector.tsx": "Renders a radio group UI for selecting a payment method (Stripe, PayPal, or Crypto) with icons and descriptions, calling an onChange callback when the selection changes.",
  "frontend/src/components/payment/PaymentSetup.tsx": "Displays a floating alert and dialog form for admins to configure Stripe by entering a secret key and allowed countries, only shown when Stripe is not yet configured.",
  "frontend/src/components/payment/PaymentSuccess.tsx": "A full-page success screen shown after a completed payment, displaying a confirmation message and a button to navigate back to the home page.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context and custom hook.",
  "frontend/src/hooks/usePetPhotoSubmission.ts": "Empty file with no content.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile management, order submission, Stripe configuration, admin checks, and Stripe checkout session creation.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines a warm neutral CSS custom property color palette for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with React Query's QueryClientProvider and the InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (using oklch variables), fonts, border radii, shadows, and accordion animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state tracking file for a pet memorial website (Furever Keepsakes and Memorials), recording existing features, new feature requests, image requirements, and architectural notes for resin memorial product pages."
}