{
  "backend/main.mo": "Main ICP actor implementing the AstCloud backend with order management, user profiles, blob slot storage, admin authorization, and Stripe payment integration. Exposes endpoints for uploading/listing image blobs, managing orders, and handling user profiles with role-based access control.",
  "backend/migration.mo": "Data migration module that upgrades the actor state by adding a new empty `blobSlots` map to the existing state containing orders and user profiles.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (Image Manager panel, dynamic image slot fetching in marketing sections, and React Query hooks for image slots) to their corresponding source files and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated summary document describing the purpose and recent changes of each frontend source file in the project.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining light and dark mode CSS custom properties for the design system color tokens and base body/border styles.",
  "frontend/index.html": "HTML entry point that sets the page title to 'Furever Keepsakes and Memorials - Pet Memorials' and mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React application file configuring TanStack Router with routes for the main marketing page, payment success/failure, and an admin-only Image Manager page, plus a profile setup modal and admin toolbar banner.",
  "frontend/src/components/admin/ImageManager.tsx": "Admin page component that displays a grid of image slot cards for managing uploadable site images (hero, shapes, about), with admin access gating and loading/error states.",
  "frontend/src/components/admin/ImageSlotCard.tsx": "Card UI component for a single image slot showing a preview, upload progress, and a file input button to upload or replace the image.",
  "frontend/src/components/marketing/Footer.tsx": "Site footer with brand info, quick-link scroll buttons, contact blurb, copyright, and a mailto link for customer inquiries.",
  "frontend/src/components/marketing/Header.tsx": "Sticky site header with logo, smooth-scroll navigation links, and a responsive mobile hamburger menu.",
  "frontend/src/components/marketing/Sections/AboutResin.tsx": "Marketing section explaining resin memorial features via three icon cards, optionally showing a custom admin-uploaded image in a two-column layout.",
  "frontend/src/components/marketing/Sections/Hero.tsx": "Hero section with headline, tagline, description, CTA buttons, and a hero image that falls back to a default if no custom image is set.",
  "frontend/src/components/marketing/Sections/PetPhotoUpload.tsx": "Empty file with no content.",
  "frontend/src/components/marketing/Sections/ProcessSteps.tsx": "Marketing section displaying the four-step handcrafted memorial process (photo capture, printing, placement, resin pour) as a grid of icon cards.",
  "frontend/src/components/marketing/Sections/ShapeShowcases.tsx": "Renders a marketing section displaying four resin memorial shape options (square, heart, hexagon, headstone) as cards with images sourced from either a backend image slot or a fallback asset, plus a badge and description for each.",
  "frontend/src/components/order/OrderForm.tsx": "A multi-field order submission form that collects pet info, buyer/contact details, shipping address, a photo upload (with preview and progress), and payment method, then submits the order via a React Query mutation.",
  "frontend/src/components/payment/PaymentFailure.tsx": "A full-page payment failure screen showing an error card with a message that no charges were made and buttons to retry or return to the home page.",
  "frontend/src/components/payment/PaymentMethodSelector.tsx": "A radio-group UI component that lets users choose between Stripe (credit/debit card) and PayPal payment methods, highlighting the selected option.",
  "frontend/src/components/payment/PaymentSetup.tsx": "An admin-only component that shows a floating alert and dialog for configuring Stripe by entering a secret key and allowed countries, visible only when the caller is an authenticated admin and Stripe is not yet configured.",
  "frontend/src/components/payment/PaymentSuccess.tsx": "A full-page payment success screen displaying a confirmation card with a success icon, a thank-you message, and a button to return to the home page.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useImageSlot.ts": "A React Query hook that fetches a direct URL for a named image slot from the backend actor, returning undefined if the slot is empty or the actor is unavailable.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/usePetPhotoSubmission.ts": "Empty file with no content.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend interactions including user profile CRUD, order submission/retrieval, Stripe configuration, admin checks, and checkout session creation using the actor pattern.",
  "frontend/src/hooks/useUploadImage.ts": "Provides a React Query mutation hook for uploading image files to the backend via chunked blob upload, tracking upload progress percentage and invalidating related image slot queries on success.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Crimson Pro, Inter), configures Tailwind layers, and defines a warm neutral OKLCH color palette with CSS custom properties for both light and dark modes.",
  "frontend/src/main.tsx": "React application entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with OKLCH CSS variable-based colors, Crimson Pro/Inter font families, custom border radii, accordion animations, and typography/container-queries/animate plugins.",
  "project_state.json": "Project state tracking file for 'Furever Keepsakes' recording existing features (admin image manager panel, dynamic image slot fetching, React Query image hooks) and pending feature requests for backend image storage with named slot keys."
}