{
  "backend/main.mo": "Main ICP actor defining data types (Animal, AstCloudOrder, Address, etc.) and endpoints for user profiles and orders, with role-based access control via MixinAuthorization and blob storage via MixinStorage.",
  "feature_evidence.json": "Feature evidence report tracking two features: generating a new clear-resin headstone mold product image and updating ShapeShowcases.tsx to use that new image (ponce-headstone-mold.dim_800x900.png).",
  "frontend-file-summaries.txt": "Auto-generated JSON document summarizing each frontend source file's purpose and recent changes, serving as a reference for build planning and feature tracking.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark color themes using OKLCH values for backgrounds, foregrounds, borders, charts, and sidebar tokens.",
  "frontend/index.html": "HTML shell with the page title 'Furever Keepsakes and Memorials - Pet Memorials' and a root div that mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component setting up TanStack Router with routes for the main page, payment success/failure, and a profile setup modal for newly authenticated users, plus admin Stripe configuration via PaymentSetup.",
  "frontend/src/components/marketing/Footer.tsx": "Site footer with branding, smooth-scroll quick links, a caffeine.ai attribution, and a contact email section linking to all4funflorida@gmail.com.",
  "frontend/src/components/marketing/Header.tsx": "Sticky navigation header with the 'Furever Keepsakes and Memorials' brand logo and smooth-scroll nav links for About, Designs, Order, and Process sections; no login/logout button.",
  "frontend/src/components/marketing/Sections/AboutResin.tsx": "Marketing section that displays three feature cards (Crystal Clear Resin, Natural Elements, Printed Photographs) explaining the materials and craftsmanship used in pet memorials.",
  "frontend/src/components/marketing/Sections/Hero.tsx": "Hero section with headline, tagline, description, and two CTA buttons (Explore Designs, How It's Made) alongside a product image of a resin memorial.",
  "frontend/src/components/marketing/Sections/PetPhotoUpload.tsx": "Empty file with no content.",
  "frontend/src/components/marketing/Sections/ProcessSteps.tsx": "Marketing section displaying a four-step process (Capture, Print, Place, Pour & Cure) for creating resin pet memorials, rendered as a 2-column card grid.",
  "frontend/src/components/marketing/Sections/ShapeShowcases.tsx": "Marketing section showcasing four resin memorial shape options (Square, Heart, Hexagon, Headstone) with images, names, descriptions, and badges in a card grid.",
  "frontend/src/components/order/OrderForm.tsx": "Order submission form collecting pet info, buyer details, shipping address, photo upload (with preview and progress), and payment method, then submitting via a mutation hook.",
  "frontend/src/components/payment/PaymentFailure.tsx": "Payment failure page that displays an error message and two buttons to retry or return home, wrapped in the site's Header and Footer.",
  "frontend/src/components/payment/PaymentMethodSelector.tsx": "Radio group component for selecting between Stripe (credit/debit card) and PayPal payment methods, with styled option cards.",
  "frontend/src/components/payment/PaymentSetup.tsx": "Admin-only component that shows a banner and dialog for configuring Stripe payment by entering a secret key and allowed countries, only visible when Stripe is not yet configured.",
  "frontend/src/components/payment/PaymentSuccess.tsx": "Full-page success screen displayed after a completed payment, showing a confirmation message and a button to return to the home page.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/usePetPhotoSubmission.ts": "Empty file with no content.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions, including user profile management, order submission, Stripe configuration, admin checks, and checkout session creation.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines CSS custom properties for a warm neutral light/dark color theme using OKLCH values.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback for sensitive values like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, defining dark mode, custom color tokens using oklch variables, typography, container queries, animation plugins, and custom font families.",
  "project_state.json": "Tracks project state for the Ponce Headstone Mold project, including existing features for generating and displaying a clear resin headstone mold image with flowers, grass, and a Yorkie portrait in a black frame."
}