{
  "backend/main.mo": "Main actor for the AstCloud backend, handling user profiles, orders (submit/retrieve), payment processing via Stripe, and access control using role-based authorization mixins.",
  "backend/migration.mo": "Data migration module that upgrades existing orders from OldAstCloudOrder (without buyerInfo) to NewAstCloudOrder (with buyerInfo), defaulting firstName and lastName to 'unknown'.",
  "feature_evidence.json": "Feature evidence report listing three implemented features: adding First/Last Name fields to the order form, removing the login/logout button from the header, and adding a contact email mailto link to the footer.",
  "frontend-file-summaries.txt": "Auto-generated summary file describing the purpose and recent changes of each frontend source file in the project.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining light and dark mode CSS custom properties for the design system's color tokens, borders, and sidebar variables.",
  "frontend/index.html": "HTML entry point that sets the page title to 'Furever Keepsakes and Memorials - Pet Memorials' and mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router routes, renders the main marketing page layout, handles Internet Identity authentication, and shows a profile setup modal for new users.",
  "frontend/src/components/marketing/Footer.tsx": "Renders the site footer with branding, quick navigation links, copyright info, a caffeine.ai attribution, and a contact email address.",
  "frontend/src/components/marketing/Header.tsx": "Sticky navigation header with a logo and smooth-scroll nav links for About, Designs, Order, and Process sections, including a mobile hamburger menu.",
  "frontend/src/components/marketing/Sections/AboutResin.tsx": "Marketing section describing the three key features of the resin memorials: crystal-clear resin, natural botanical elements, and embedded printed photographs.",
  "frontend/src/components/marketing/Sections/Hero.tsx": "Hero section with headline copy, tagline, description, CTA buttons to scroll to Designs or Process, and a featured product image.",
  "frontend/src/components/marketing/Sections/PetPhotoUpload.tsx": "Empty file with no content.",
  "frontend/src/components/marketing/Sections/ProcessSteps.tsx": "Four-step process section explaining how each memorial is made: photo selection, professional printing, botanical placement, and resin pour/cure.",
  "frontend/src/components/marketing/Sections/ShapeShowcases.tsx": "Grid showcase of four available resin memorial shapes (Square, Heart, Hexagon, Headstone), each with a product image, pet name, badge, and description.",
  "frontend/src/components/order/OrderForm.tsx": "Order submission form that collects pet details, a photo upload, buyer/contact info, and shipping address, then submits the order via a mutation hook with Internet Identity authentication and Stripe payment selection.",
  "frontend/src/components/payment/PaymentFailure.tsx": "Displays a payment failure page with an error message and buttons to retry or return home, wrapped in the site's Header and Footer.",
  "frontend/src/components/payment/PaymentMethodSelector.tsx": "Renders a radio group UI for selecting between Stripe (credit/debit card) and PayPal payment methods.",
  "frontend/src/components/payment/PaymentSetup.tsx": "Shows an admin-only UI (fixed alert + dialog) for configuring Stripe by entering a secret key and allowed countries, only visible when Stripe is not yet configured.",
  "frontend/src/components/payment/PaymentSuccess.tsx": "Displays a payment success confirmation page with a thank-you message and a button to return home, wrapped in the site's Header and Footer.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, managing login, logout, and identity persistence via DFINITY's AuthClient.",
  "frontend/src/hooks/usePetPhotoSubmission.ts": "Empty file with no content.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile, order submission, order retrieval, Stripe configuration, admin checks, and checkout session creation.",
  "frontend/src/index.css": "Defines global CSS including Google Fonts imports, Tailwind directives, and a warm-neutral CSS custom property theme for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those values using sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (using oklch variables), fonts, border radii, animations, and enabling the typography, container-queries, and animate plugins.",
  "project_state.json": "Project state file tracking the All4Fun Florida Order Form site's version, architectural notes, completed features (name fields, login removal, contact email), and pending feature requests."
}