{
  "kind": "build_request",
  "title": "Add name fields to order form, remove login button, add contact email to footer",
  "projectName": "Furever Keepsakes",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add 'First Name' and 'Last Name' input fields to the order form in OrderForm.tsx, positioned immediately before the shipping address fields. Both fields should be required and their values should be included in the order submission payload.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "before the shipping address needs to be the first and last name of the person shipping to"
        ]
      },
      "acceptanceCriteria": [
        "A 'First Name' text input appears directly above the shipping address section in the order form",
        "A 'Last Name' text input appears directly below 'First Name' and above the shipping address section",
        "Both fields are required and show validation errors if left blank on submission",
        "First and last name values are sent as part of the order submission data to the backend"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove the Internet Identity login/logout button from the Header component (frontend/src/components/marketing/Header.tsx) so that the sticky header contains only the logo and navigation links, with no authentication controls visible.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "We also dont need a log in button at the top if this is just a simple order form and payment method"
        ]
      },
      "acceptanceCriteria": [
        "The login/logout button is no longer visible in the header on desktop or mobile",
        "The mobile menu also does not contain a login/logout option",
        "The header still displays the logo and navigation links correctly"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add the contact email address 'all4funflorida@gmail.com' to the very bottom of the website in the Footer component (frontend/src/components/marketing/Footer.tsx), presented as a clickable mailto link with a label such as 'Questions? Email us at all4funflorida@gmail.com'.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add the email address for people to ask questions to at the very bottom of the website. all4funflorida@gmail.com"
        ]
      },
      "acceptanceCriteria": [
        "The email address 'all4funflorida@gmail.com' is displayed at the very bottom of the page footer",
        "The email is rendered as a clickable mailto link",
        "The link is accompanied by a short prompt such as 'Questions? Email us at' to provide context",
        "The styling is consistent with the existing footer design"
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts or frontend/src/hooks/useActor.ts",
    "Do not alter the Internet Identity authentication logic itself, only remove the UI button from the header",
    "Preserve all existing order form fields and functionality"
  ],
  "nonGoals": [
    "Redesigning the overall header or footer layout beyond the specified changes",
    "Adding additional contact methods (phone, social media) beyond the requested email",
    "Changing the backend order schema beyond adding first/last name fields",
    "Adding authentication flows or user profile features"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}