{
  "kind": "build_request",
  "title": "Generate clear resin headstone mold image with flowers, grass, and Yorkie portrait for Ponce",
  "projectName": "Furever Keepsakes",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Generate a new headstone mold product image showing a clear resin headstone shape with flowers and green grass elements embedded inside, and a male Yorkie dog portrait displayed inside a black square frame centered on the headstone. This image should replace or be used as the Headstone shape showcase image in ShapeShowcases.tsx.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "make a clear resin headstone mold with flowers, grass, and a picture of a male yorkie inside a black square frame to put for Ponce headstone picture"
        ]
      },
      "acceptanceCriteria": [
        "The headstone mold image depicts a clear/transparent resin headstone shape",
        "Flowers and green grass are visibly embedded within the resin",
        "A male Yorkie dog portrait is centered on the headstone inside a solid black square frame",
        "The image is used in the Headstone card within ShapeShowcases.tsx"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Headstone shape card in ShapeShowcases.tsx to render the newly generated clear resin headstone mold image (ponce-headstone-mold.dim_800x900.png) as its showcase photo.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "to put for Ponce headstone picture"
        ]
      },
      "acceptanceCriteria": [
        "The Headstone card in ShapeShowcases.tsx displays the new ponce-headstone-mold image",
        "The image loads from frontend/public/assets/generated/ponce-headstone-mold.dim_800x900.png",
        "No other shape cards are affected"
      ]
    }
  ],
  "constraints": [
    "Do not modify any immutable frontend paths (hooks, main.tsx, ui components)",
    "Only the Headstone shape card image should be updated in ShapeShowcases.tsx"
  ],
  "nonGoals": [
    "Changing backend data models or order logic",
    "Modifying any other shape showcase cards (Square, Heart, Hexagon)",
    "Adding new routes or pages"
  ],
  "imageRequirements": {
    "required": [
      "Clear transparent resin headstone mold shape with colorful flowers (roses, daisies) and green grass blades embedded inside the resin, centered with a male Yorkshire Terrier (Yorkie) dog portrait inside a solid black square frame on the face of the headstone, photorealistic resin craft style (ponce-headstone-mold.dim_800x900.png)"
    ],
    "edits": []
  }
}