{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add name fields to order form, remove login button, add contact email to footer",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add 'First Name' and 'Last Name' input fields to the order form before shipping address, make them required, and include them in the order submission payload",
      "acceptanceCriteria": [
        "A 'First Name' text input appears directly above the shipping address section in the order form",
        "A 'Last Name' text input appears directly below 'First Name' and above the shipping address section",
        "Both fields are required and show validation errors if left blank on submission",
        "First and last name values are sent as part of the order submission data to the backend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/order/OrderForm.tsx",
          "operation": "modify",
          "description": "Add firstName and lastName state variables to the OrderForm component. Insert two new input fields (First Name and Last Name) immediately before the shipping address section, using the same styling pattern as existing form inputs. Add required validation for both fields. Update the form submission handler to include firstName and lastName in the buyerInfo object when calling submitOrder. Ensure the inputs are properly labeled and accessible."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove the Internet Identity login/logout button from the Header component so only logo and navigation links remain visible",
      "acceptanceCriteria": [
        "The login/logout button is no longer visible in the header on desktop or mobile",
        "The mobile menu also does not contain a login/logout option",
        "The header still displays the logo and navigation links correctly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/marketing/Header.tsx",
          "operation": "modify",
          "description": "Remove the Internet Identity login/logout button from both the desktop header and mobile menu. Delete the button element and any associated click handlers or authentication state references from the Header component. Ensure the remaining header layout (logo and navigation links) is properly styled and centered without the button. Do not modify the useInternetIdentity hook or any authentication logic files."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add the contact email address 'all4funflorida@gmail.com' to the very bottom of the Footer component as a clickable mailto link with a descriptive label",
      "acceptanceCriteria": [
        "The email address 'all4funflorida@gmail.com' is displayed at the very bottom of the page footer",
        "The email is rendered as a clickable mailto link",
        "The link is accompanied by a short prompt such as 'Questions? Email us at' to provide context",
        "The styling is consistent with the existing footer design"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/marketing/Footer.tsx",
          "operation": "modify",
          "description": "Add a new section at the very bottom of the Footer component (below the existing copyright and attribution section). Insert a text prompt such as 'Questions? Email us at' followed by a clickable mailto link to 'all4funflorida@gmail.com'. Style the email link consistently with the existing footer design, using appropriate text colors and hover states. Ensure proper spacing between this new contact section and the existing footer content."
        }
      ]
    }
  ]
}